//Техологично училище Електронни системи към ТУ София
//11 А
//22
//Николай Тихомиров Коцев
//Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<=x<10. Да се инициализира масив от 10 елемента. Да се намерят първите 10 стойности на функцията cos(x) в интервала [0; +?), в които третата цифра след десетичната запетая е x. Пример при cos(1) = 0.540302306 третата цифра след десетичната запетая е 0. При cos(2) = -0.416146837 третата цифра след десетичната запетая е 6. Намерените стойности да се зададат като стойности на елементите в масива. Елементите на масива да се изведат на стандартния изход.

#include<stdio.h>
#include<math.h>
int main(){
    double c=0,arr[9];
    long long int x,i=0,p=1,cv;
    printf("Enter x:");
    scanf("%lld",&x);
    while (i<=9){
          cv=cos(p)*1000;
          if ((((int)cv) % 10)==x){
             arr[i] = p;
             i++;     
          }
          p++;      
    }
    printf("Array :\n");
    for (i=0;i<=9;i++){
        printf("Element %lld =%lld \n" ,i , arr[i]);
        }
    system("PAUSE");
    return 0;
    }
