//Техологично училище Електронни системи към ТУ София
//11 А
//22
//Николай Тихомиров Коцев
//Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<=x<10. Да се инициализира масив от 10 елемента. Да се намерят първите 10 числа на Фибоначи в [0; +?), които се делят на x без остатък. Намерените стойности да се зададат като стойности на елементите в масива. Елементите на масива да се изведат на стандартния изход.

#include <stdio.h>

int main(){
    int x,i=0,arr[9],a=0,b=1,c=0;
    do{
    printf("Enter x:");
    scanf("%d",&x);
    }
    while ((x<0)||(x>=10));
    while (i<=9){
          c=a+b;
          a=b;
          b=c;   
          if ((c%x)== 0){
              arr[i]=c;
              i++;        
              }                     
          }
    for (i=0;i<=9;i++){
        printf("Element %d = %d \n",i,arr[i]);
        }
    system ("PAUSE");    
    return 0;
    }
